# IsReporting Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilyParameter..::..IsReporting Property
FamilyParameter Class See Also
---
Indicates if the parameter is a reporting parameter.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public bool IsReporting { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsReporting As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsReporting {
	bool get ();
}
```

# Remarks
If true, the parameter is a reporting parameter associated to a dimension value, and cannot be modified. If false, the parameter is a driving parameter and if associated to a dimension, can modify the dimension it labels.
# See Also
FamilyParameter Class
Autodesk.Revit.DB Namespace